#include <stdio.h>

// Функция шифрования строки шифром Цезаря
// char* str — специальная переменная, которая хранит адрес ячейки памяти, где находится другая переменная или функция
// int k — сдвиг
void encrypt(char* str, int k) {
    // Проходим по всем символам строки, пока не встретим '\0'
    for (int i = 0; str[i] != '\0'; i++) {
        if (str[i] >= 'A' && str[i] <= 'Z') {
            // (str[i] - 'A') — превращаем букву в число от 0 до 25
            // + k — прибавляем сдвиг
            // % 26 — зацикливаем (чтобы после Z шла A)
            // + 'A' — превращаем число обратно в букву
            // 
            // % для отрицательных чисел может дать отрицательный результат. Поэтому добавляем 26 перед модулем: ((x % 26) + 26) % 26
            str[i] = ((str[i] - 'A' + k) % 26 + 26) % 26 + 'A';
        }
        // Обрабатываем строчные буквы (a-z)
        else if (str[i] >= 'a' && str[i] <= 'z') {
            str[i] = ((str[i] - 'a' + k) % 26 + 26) % 26 + 'a';
        }
    }
}

int main() {
    int k;
    char str[1000];
    
    // Считываем сдвиг
    scanf("%i", &k);
    
    // Считываем строку до конца строки
    // %[^\n] означает "считывать всё, кроме символа переноса строки"
    scanf(" %[^\n]", str);
    

    encrypt(str, k);
    
    printf("%s\n", str);
    
    return 0;
}